try:
    print("\n----Фермерские дни----")
    print("Вы-кролик с именем Пятик, жили на небольшой ферме со своими уже знакомыми мордочками-Рыжиком и Ушастиком." \
    "Однажды утром хозяин объявил,что скоро приедут гости,чтобы выбрать кролика для своего дома. Хозяин подготовил для ушастых " \
    "специальное место,чтобы все могли спокойно познакомиться с животными." \
    "Утром кролики решили поиграть и случайно опрокинули корзины с сеном,рассыпали корм,испачкав подготовленное место.До приезда гостей оставалось два часа." \
    "Чаще всего вы руководите ситуациями,в которых ваши друзья паникуют. Что будете делать?")
    c_1=input("(а):Попросить помощи у хозяина и признаться"
    "(б):Попробовать убрать всё самостоятельно,чтобы никто ничего не заметил: ").lower()
    if c_1=="а":
        print("Вам помоги навести порядок за короткое время,но попросили быть впредь осторожными. Незадолго до приезда гостей вы замечаете,что Рыжик сидит в домике,явно не собираясь выходить," \
        "так как боится людей,что будете делать?")
        c_2=input("(а):Поддержать друга,дать ему время чтобы привыкнуть"
        "(б): уговорить его выйти,так как скоро приедут гости: ").lower()
        if c_2=="а":
            print("Рыжик  успокоился благодаря вашим словам и сможет познакомиться  с гостями в удобном ему темпе. Вот,наконец,приехали гости,начиная выбирать кролика. Что будете делать?")
            c_3=input("(а): вести себя спокойно,приветливо,не привлекая лишнего внимания,давая гостям рассмотреть и себя,и друзей"
            "(б):Стараться привлечь всё внимание себе,чтобы взяли именно тебя: ").lower()
            if c_3=="а":
                print("Концовка 'Лучшие друзья': Благодаря вышей поддержке и правильному поведению,Рыжику удалось понравиться гостям. Вы с Ушастиком продолжили жить вдвоём,но пожелали кролику удачи,вы запомните" \
                "его как верного друга")
            else:
                print("Концовка 'Нехватка внимания': Вы завоевали интерес гостей,из за чего вас решили забрать. Друзья порадовались за вас,взяв такой вариант на будущее.")
        elif c_2=="б":
            print("Концовка 'Ну и не надо': Рыжик был взволнован и также напуган. Ему было неудобно,из за чего вы тоже вели себя странно. Гости взяли с собой Ушастика,оставив вас с Рыжиком в неприятном состоянии.")
        
    elif c_1=="б":
        print("Концовка 'Безответственные': вы не успели прибраться,из за чего были наказаны. Гости никого не взяли,а хозяин перенёс встречу на другую дату.")
    else:
        print("Не поняв,что вы хотите,всё осталось так,как оно и было")
    print("Так всё и закончилось")
except ValueError:
    print("Ввёл не тот тип данных!")